let handler = async (m, { conn, command, text }) => {
	
    if (!text) return conn.reply(m.chat, 'حط اسم', m)
	
  let personalidad = `
*┆⎔ *⎔┉═〘الشخصيه〙⌯═⎔*
*┆⛥ 『الاسم📝』* : ${text}
*┆⛥ 『الاخلاق الجيدة😌』* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┆⛥ 『الاخلاق السيئة 🙂』* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┆⛥ 『نوع الشخصية🌿』* : ${pickRandom(['طيب القلب','متكبر','بخيل','كريم','متواضع','خجول','جبان','فضولي','محبوب','كريم', 'ذكي'])}
*┆⛥ 『دائما👀』* : ${pickRandom(['متوتر','سيء','مشتت','مزعج','نمام','بيقرا كتب','خروجات','بيتفرج ع الانمي','فاتح واتس','بيكدب','سيمب','ماسك الفون'])}
*┆⛥ 『الجمال🫣』* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┆⛥ 『القبح🤡』* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┆⛥ 『الشجاعة💪』* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┆⛥ 『الجبن🤕』* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┆⛥ 『الشهرة😎』* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┆⎔ *⎔┉═〘𝑹𝑰𝑻𝑨〙⌯═⎔*
`	
conn.reply(m.chat, personalidad, m, { mentions: conn.parseMention(personalidad) })
}
handler.help = ['personalidad *<nombre>*']
handler.tags = ['fun']
handler.command = /^شخصية|الشخصيه|الشخصية|شخصيه/i

export default handler 

function pickRandom(list) {
  return list[Math.floor(Math.random() * list.length)]
                                }
