let handler = async (m, { command, text }) => m.reply(`'✾━╃━━「🌕」━━╄━✾  
 *〘🗡️𝘽𝙇𝘼𝘾𝙆⚔️𝙉𝙄𝙂𝙃𝙏🪄〙*


*اسـتمـــــــارة الــدخــول*

*⟐ الــقـــب┇「」*

*⟐ إنــمــي┇「」*

*⟐ ولــد أمـ بنــت ┇「」*

*⟐ من طـــرف┇「」*


*✾━╃━━「🌕」━━╄━✾*

*✦┇ ملاحظة*

*✦ ┇ يمنع أن يأخذ ولد لقب بنت و العكس*

*✦┇إن لم يتم تعبئـة الاسـتمارة خـلال 48 سـاعة يتـم طردك من الاستقبال*

*✦┇صورة للقب 📸*

*✾━╃━━「🌕」━━╄━✾*

*مـ؏ تـحــيـاتـي إلـى إدارة╎*

*〘🗡️𝘽𝙇𝘼𝘾𝙆⚔️𝙉𝙄𝙂𝙃𝙏🪄〙*
*✾━╃━━「🌕」━━╄━✾*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(استمارة|1|استماره\استمارة)$/i

export default handler